[
    {
        "headline": "Sound Lights",
        "intro": "An stage for Sergio Bulgakov with custom language to perform a concert",
        "description": "It's a handmade stage with an own library to execute lights based in music. This project is for a Sitar musician Sergio",
        "image": "assets/images/soundLights.jpg",
        "technologies": [
            "C",
            "C++"
        ],
        "github": "https://github.com/andres-cox/SoundLights",
        "artist-web": "http://www.bulgakov.com.ar/sergio/",
        "details": {
            "title": "Sound Lights Stage",
            "summary": "Sergio  plays the Sitar, he teaches and creates shows. He wanted to take a step further and started creating this stage with 2 elevators, 1 backlight and 1 frontlight; everything with leds of high power and motors. We used 2 Arduino Mega to control all the stage and create two libraries in order to create an artistic language that performs based in time, without technical issues.",
            "images": [
                "assets/soundLights/img01.jpg",
                "assets/soundLights/img02.jpg",
                "assets/soundLights/img03.jpg",
                "assets/soundLights/img04.jpg",
                "assets/soundLights/img05.jpg",
                "assets/soundLights/img06.jpg",
                "assets/soundLights/img07.jpg",
                "assets/soundLights/img08.jpg",
                "assets/soundLights/img09.jpg",
                "assets/soundLights/img10.jpg",
                "assets/soundLights/img11.jpg",
                "assets/soundLights/img12.jpg",
                "assets/soundLights/img13.jpg",
                "assets/soundLights/img14.jpg",
                "assets/soundLights/img15.jpg",
                "assets/soundLights/img16.jpg",
                "assets/soundLights/img17.jpg",
                "assets/soundLights/img18.jpg",
                "assets/soundLights/img19.jpg",
                "assets/soundLights/img20.jpg"
            ],
            "cards": [
                {
                    "subtitle": "The Hardware Part",
                    "text": "Sergio had a clear idea of what he wanted. Clearly there should be 4 lights for the front, back, left and right position. The left and the right would be elevator, the front a travalinera and the back just a ligth. All parts should have a servo to have another degree of freedom. and a motor DC for the elevator and the travalinera. The assembling part took the longest, welding and creating the main board. Each light should have 3 leds for Red Green Blue format and also 1 black light in the bottom. To have control for all lights and motors we needed 2 Arduino Mega the main need was the PWA signals and the analog inputs. Of course there are chips that solves these problems but he didn't want to overcomplicate the control part since he had 2 Arduino and he wanted to divide the project in 2 parts. Once all finished while testing everything with a basic program there was problem that delayed the project a bit. There was a problem with the long wires.",
                    "image": "assets/images/moviesPwa.png"
                },
                {
                    "subtitle": "The Long Wires",
                    "text": "Because of the long wires the PWA signals of the Arduino weren't reaching fine to the motors and created a bad performance that even manipulate the lights. This was an unexpected problem, we create a small prototype because we though there was a short-circuit, but there wasn't and in this small prototype we put a long wire and it was working fine. Sergio at this time was spiritless, because it took too much time and money to reach this point. We though there should be a problem in the main board, taking out some parts of it and cutting a bit the wires we could se that an elevator was working fine. But assempling all there was the problem again. Sincerely I couldn't find what in the board was causing this, maybe some interference between wires  because of the high voltage? but there was a clear issue, PWA signals for the motors and lights weren't working fine. So instead of looking what was wrong I started thinking how can I solve that problem. Unfortunately I didn't have an Oscilloscope to watch what signal was reaching the motor, at the beginning I though there was a problem with the arduino, with its timer, but it wasn't that. By studying and discarding problems I bet on a solution, I used an optocoupler at the entrance of the signal in the motor this might recreate the PWA signal from 5V again and it worked!!! We didn't get this problem again. I have to highlight this problem from others because it really affectet Sergio's willing. Without solving it we couldn't reach what Sergio was imaginating all the time while building this project.",
                    "image": "assets/images/moviesPwa.png"
                },
                {
                    "subtitle": "The Software Part",
                    "text": "Once solved all hardware problems we finally could focus in the software, at the beginning Sergio was creating some sketches to show me what functions he wanted to use. Controlling multiple elements for just one movement, there was a lot of code. So I created functions to manage it better, and then created a library to move all the unnecessary code that Sergio didn't need to touch. Eventually with the guide of Sergio, I created a confortable library for him that could be call as an artistic language because now he has to learn how to use this new tool in an artistic way and show in the stage what he is imaginating and what he wants to share. <br> To interact with the sound theres is no other method that use the time function of the Arduino, and trigger movements and lights based in a timeline. We wanted to use an mp3 module in order to have more control but the Sound quality was not good enough for Sergio. So we trigger the timer from the earphone jack of an IPod.",
                    "image": "assets/images/moviesPwa.png"
                }
            ],
            "conclusion": "Ending with all the proposed goals and seen the whole project working I could see what Sergio was imaginating, there was this meaningful feeling of having fulfilled a person's wish. This was an unvaluable experience, I think the main purpose when working with someone is to make the other feel the same desire that you want to achieve, the same goal. I felt that while working with Sergio. <br> Now he is in another stage of the project, the artistic part, like practice an instrument to perform a song. He needs to find a way to use this new project as a tool in his events, so he is testing lights and position with his music and upgrading mechanical parts of it."
        }
    },
    {
        "headline": "Box Speaker",
        "intro": "A box that works an amplifier and makes some atary sounds",
        "description": "The box is for Leandro, an animator, he gives the box to kids, they pressed it and he do different things based in the sound.",
        "image": "assets/images/boxSound.jpg",
        "technologies": [
            "C",
            "C++"
        ],
        "github": "",
        "artist-web": "",
        "details": {
            "title": "A Curious Box",
            "summary": "Leandro is an animator and he has many events with kids. And he had this particular small toy that creates ATARY sounds. He has this with a monocycle he gigest the toy to one of the kids and depending of the sound he moves. And there is an special bottom in which he falls. It's a funny show. Once we meet he told me that he wanted to improve that toy, essentially he wanted it louder and more atractive.",
            "images": [
                "assets/soundBox/img01.jpg",
                "assets/soundBox/img02.jpg",
                "assets/soundBox/img03.jpg",
                "assets/soundBox/img05.jpg",
                "assets/soundBox/img06.jpg",
                "assets/soundBox/img07.jpg",
                "assets/soundBox/img08.jpg",
                "assets/soundBox/img09.jpg",
                "assets/soundBox/img10.jpg"
            ],
            "cards": [
                {
                    "subtitle": "The Basic Toy",
                    "text": "This was the main toy, pretty simple and small and it works with a couple of batteries. At the beginning I wanted to recreate all with an arduino micro and sound module in order to have custom sounds for the buttons. But he was fine with the sounds, so I had to reuse this main board and upgrade it. But there was a problem, the main circuit was protected, so you can't see its datasheet and had to work over the paths you see. I had 3 tasks, change the buttons for arcade ones, upgrade the speaker sound and use a battery pack as its main source.",
                    "image": "assets/images/moviesPwa.png"
                },
                {
                    "subtitle": "Improving the Sound",
                    "text": "Changing the buttons was the easiest part and it worked fined. In order to upgrade the sound there is this lack of power, that's why I used a pack of batteries from those portable batteries I rather used one of this instead of creating one because its charger module isn't easy to find. So with this portable battery we have its charger module and its conversor from 3.7V to 5V. For the amplifier module for the speaker we need 12V min so needed to use an step up dc-dc module and then the amplifier was working fine.",
                    "image": "assets/soundBox/img04.jpg"
                },
                {
                    "subtitle": "Assembling Everything",
                    "text": "I had all the modules working fine, I used my smartphone earphone jack to test the sound of the speaker. And its sound was cool. It was the time to use it with the toy and there was the problem, the arcade buttons were working fine but the sound was very low, there was a ground issue. The principal conection of the toy was different from I was expecting. Since I couldn't see the main circuit I had to test all the paths, and finally there I found that the step-up module was not working fine with the amplifier, I create a new conection to the main board an it was working great. I added jack cable as a new function, just to listen music with the box.",
                    "image": "assets/images/moviesPwa.png"
                }
            ],
            "conclusion": "This was interesting project, without knowing the main circuit. It's quite difficult to use it, because you don't know its data and by testing you can break it. So you just have to trust in its Inputs and Outputs of its principal circuit. <br>  After I gave the new toy to Leandro, he told me that the kids were really suprised and everyone wanted to use it, even their parents. It was a unique device and since it's transparent it grabs the attention of everyone."
        }
    },
    {
        "headline": "Paint Touch Sound",
        "intro": "A small prototype to create a mural with sound.",
        "description": "The main idea was to create a mural instrument in which you can touch an it speaks.",
        "image": "assets/images/muralSound.png",
        "technologies": [
            "C",
            "C++"
        ],
        "github": "",
        "artist-web": "",
        "details": {
            "title": "Discover Movies Details",
            "summary": "I made this app for my self, I wanted to have all movies data in my hand and get its information as easy as posible. I always had to look for movies by my self, looking in webpages and youtube videos. But those often weren't good enough for me. So I created this app in order to find movies easely. Looking for movies by actor and check if they have awards and nominations. I also wanted to check if they were available in streaming platforms for that I use Justwatch API but unfortunatly we can use it only in local do to its CORS policy.",
            "images": [
                "assets/soundMural/img01.jpg",
                "assets/soundMural/img02.jpg",
                "assets/soundMural/img03.jpg",
                "assets/soundMural/img04.jpg",
                "assets/soundMural/img05.jpg",
                "assets/soundMural/img06.jpg",
                "assets/soundMural/img07.jpg",
                "assets/soundMural/img08.jpg",
                "assets/soundMural/img09.jpg",
                "assets/soundMural/img10.jpg",
                "assets/soundMural/img11.jpg"
            ],
            "cards": [
                {
                    "subtitle": "Tabs Design",
                    "text": "I only wanted to have three tabs. Home tab is the welcome page in which we have the search bar, popular movies, tvshows and recomendations, these last one appear once we checked our favorite ones and it's based in TMDB api system. Discovery tab would be a place to find the most popular movies by year and genre. And the last tab for our personal list for movies. The ones we have seen, favorites and to watch.",
                    "image": "assets/images/moviesPwa.png"
                },
                {
                    "subtitle": "The Movie Database API",
                    "text": "This API is very popular it's used in many other sides, so I wanted to try it as well. When I checked its documentation I saw that it was very organized and it had most of the functionality I was looking for, movie details, recomendations, actor movies and so on. Then I realized that it hasn't have actor's tvshows as a basic query so I had to implement a search query, that has its disadvantage, because the response isn't quite clean and I had to make some filters in order to have the results I was expecting. I finished all the app based in just this API, then I wanted to move forward to implement nominations details and streaming availability that this API don't offer.",
                    "image": "assets/images/moviesPwa.png"
                },
                {
                    "subtitle": "Wikipedia API",
                    "text": "Once we have seen an organized API, Wikipedia give me some good hours to study, this API is very complex. Before this API I was looking for a more specific API for movie nominations but I couldn't find a good one. So I decided to use Wikipedia because is like an open encyclopedia, and maybe it'll be useful for another future project. When I look more deep into it, I saw that it has multiple queries and it hasn't have as good examples as I wanted, but well it's just a new tool to learn so I studied all its options and finally I could create the query I wanted, the one that returns movie nominations. But it's not as clean as I would like, because in order to exact table of a movie page I have to request two queries. One for seeking nominations section and the other to extract the html of that table, there is a way to do it in just one query but now it comes the second problem, I look for movie queries based in its title (tmdb title) because there isn't id relation, so we have the title and it works for most of the movies, but for those that don't, we have to create another query, you can see in the image the queries I had to create in order to have most of the movies nominations details. I still think it's not a clean solution but it works, and that is all I wanted.",
                    "image": "assets/images/moviesPwa.png"
                },
                {
                    "subtitle": "Justwatch API",
                    "text": "Justwatch is the only site in which we found movies streaming data, I was looking a way to implement it in my site but there isn't an official way. I found this <a>resource</a> an it's a basic API it doesn't offer too much info about the queries but it informs a way to use it. Once studied I was looking a way to implement it by TMDb ids, but there isn't a specific query for this, even though it has an 'TMDb id' attribute, I was testing to do it but unfortunatly it couldn't be possible because of the limited queries, instead I went for the search funtion by title and interesting it matches quiet fine in every search. So this works, there is a problem when it does not find the movie and thats why I double check the response with the initial title to be sure about the result. Although this only works in a local enviroment an it's not available for production do to its CORS policy",
                    "image": "assets/images/moviesPwa.png"
                }
            ],
            "conclusion": "This is a useful app, I really enjoyed doing it. It was a great experience with different APIs. And I use it every time I don't know what to watch and to find past interesting movies, not just the trends."
        }
    }
]